

Функция ПолучитьВалютныйСчет(Валюта) Экспорт

	Если Валюта = Справочники.Валюты.RUB Тогда
		Счет = ПланыСчетов.ПланСчетовХозрасчетныйМС.BankRUBAccounts;
	ИначеЕсли Валюта = Справочники.Валюты.USD Тогда	
		Счет = ПланыСчетов.ПланСчетовХозрасчетныйМС.BankUSDAccounts;
	ИначеЕсли Валюта = Справочники.Валюты.EUR Тогда	
		Счет = ПланыСчетов.ПланСчетовХозрасчетныйМС.BankEURAccounts;
	КонецЕсли;
	
	Возврат Счет;
	
КонецФункции

Функция ПолучитьРублевуюСумму(Валюта, Период, Сумма) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Сумма * ВыборкаДетальныеЗаписи.Курс;
	КонецЦикла;

	Возврат 0;
	
КонецФункции
 