
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Склад КАК Склад,
		|	ТЗ.Товар КАК Товар
		|ПОМЕСТИТЬ ВТ_
		|ИЗ
		|	&ТЗ КАК ТЗ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Склад,
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_.Склад КАК Склад,
		|	ВТ_.Товар КАК Товар
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ВТ_ КАК ВТ_
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_.Склад,
		|	ВТ_.Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Товар КАК Товар,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Количество
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&ПериодКон,
		|				Склад = &Склад
		|					И Товар В
		|						(ВЫБРАТЬ
		|							ВТ.Товар
		|						ИЗ
		|							ВТ)) КАК ОстаткиТоваровОстатки
		|		ПО (ОстаткиТоваровОстатки.Товар = ВТ.Товар)
		|			И (ОстаткиТоваровОстатки.Склад = ВТ.Склад)";
	
	Запрос.УстановитьПараметр("ТЗ", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("ПериодКон", ?(Параметры.Ключ.Пустая(), ТекущаяДата(), Объект.Дата));
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Объект.Товары.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
