
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СчетДт = ОбщийМодульСервер.ПолучитьВалютныйСчет(Валюта);
	СчетКт = ПланыСчетов.ПланСчетовХозрасчетныйМС.Вспомогательный;
	
	Если Валюта = Справочники.Валюты.RUB Тогда
		СуммаРуб = Сумма;
	Иначе
		СуммаРуб = ОбщийМодульСервер.ПолучитьРублевуюСумму(Сумма, Дата, Валюта);
	КонецЕсли;
	
	// регистр ХозрасчетныйМС 
	Движения.ХозрасчетныйМС.Записывать = Истина;
	Движение = Движения.ХозрасчетныйМС.Добавить();
	Движение.СчетДт = СчетДт;
	Движение.СчетКт = СчетКт;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаРуб;
	Движение.ВалютнаяСумма = Сумма;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетныеМС.Организации] = Организация;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетныеМС.БанковскиеСчета] = БанковскийСчет;
	
КонецПроцедуры
