
#Область СобытияКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОчиститьСообщения(); 
	
	СформироватьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()  
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьГруппировкаДень = Макет.ПолучитьОбласть("ГруппировкаДень");
	ОбластьГруппировкаСчет = Макет.ПолучитьОбласть("ГруппировкаСчет");
	ОбластьГруппировкаКонтрагент = Макет.ПолучитьОбласть("ГруппировкаКонтрагент");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);  

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДЕНЬ(ХозрасчетныйМСОстаткиИОбороты.Период) КАК ПериодДень,
		|	ХозрасчетныйМСОстаткиИОбороты.Субконто2 КАК БанковскийСчет,
		|	ХозрасчетныйМСОстаткиИОбороты.Регистратор КАК Регистратор,
		|	ЕСТЬNULL(ХозрасчетныйМСОстаткиИОбороты.Регистратор.Контрагент, ""Without Contractor"") КАК Контрагент,
		|	ХозрасчетныйМСОстаткиИОбороты.ВалютнаяСуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ХозрасчетныйМСОстаткиИОбороты.ВалютнаяСуммаОборотДт КАК СуммаОборотДт,
		|	ХозрасчетныйМСОстаткиИОбороты.ВалютнаяСуммаОборотКт КАК СуммаОборотКт,
		|	ХозрасчетныйМСОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ИЗ
		|	РегистрБухгалтерии.ХозрасчетныйМС.ОстаткиИОбороты(, , Регистратор, , , , ) КАК ХозрасчетныйМСОстаткиИОбороты
		|ИТОГИ
		|	СУММА(СуммаНачальныйОстаток),
		|	СУММА(СуммаОборотДт),
		|	СУММА(СуммаОборотКт),
		|	СУММА(СуммаКонечныйОстаток)
		|ПО
		|	ПериодДень,
		|	БанковскийСчет,
		|	Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПериодДень = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПериодДень.Следующий() Цикл
		
		// Вставить обработку выборки ВыборкаПериодДень
		ОбластьГруппировкаДень.Параметры.Заполнить(ВыборкаПериодДень);
		ТабДок.Вывести(ОбластьГруппировкаДень);
		ТабДок.НачатьГруппуСтрок();

		ВыборкаБанковскийСчет = ВыборкаПериодДень.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаБанковскийСчет.Следующий() Цикл
			
			// Вставить обработку выборки ВыборкаБанковскийСчет
			ОбластьГруппировкаСчет.Параметры.Заполнить(ВыборкаБанковскийСчет);
			ТабДок.Вывести(ОбластьГруппировкаСчет);
			ТабДок.НачатьГруппуСтрок();
			
			ВыборкаКонтрагент = ВыборкаБанковскийСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКонтрагент.Следующий() Цикл
				
				// Вставить обработку выборки ВыборкаКонтрагент
				ОбластьГруппировкаКонтрагент.Параметры.Заполнить(ВыборкаКонтрагент);
				ТабДок.Вывести(ОбластьГруппировкаКонтрагент);
				ТабДок.НачатьГруппуСтрок();
				
				ВыборкаДетальныеЗаписи = ВыборкаКонтрагент.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
					ТабДок.Вывести(ОбластьСтрока);
				КонецЦикла;
				
				ТабДок.ЗакончитьГруппуСтрок();	
				
			КонецЦикла;
			
			ТабДок.ЗакончитьГруппуСтрок();	
			
		КонецЦикла;
		
		ТабДок.ЗакончитьГруппуСтрок();	

	КонецЦикла;
	
	ТабДок.ФиксацияСверху = 1;
	ТабДок.ФиксацияСлева = 4;    
	
КонецПроцедуры

#КонецОбласти

