
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СчетКт = ОбщийМодульСервер.ПолучитьВалютныйСчет(Валюта);
	СчетДт = ПланыСчетов.ПланСчетовХозрасчетныйМС.Вспомогательный;
	Курс = 0;
	СуммаРУБ = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйМСОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
	|	ХозрасчетныйМСОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) КАК Курс
	|ИЗ
	|	РегистрБухгалтерии.ХозрасчетныйМС.Остатки(
	|			&Период,
	|			Счет = &Счет,
	|			&ВидыСубконто,
	|			Субконто1 = &Организация
	|				И Субконто2 = &БанковскийСчет) КАК ХозрасчетныйМСОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
	|		ПО (ИСТИНА)";
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетныеМС.Организации);	
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетныеМС.БанковскиеСчета);	
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Счет", СчетКт);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Курс = ВыборкаДетальныеЗаписи.Курс;
		СуммаРУБ = Сумма * Курс;
		Если ВыборкаДетальныеЗаписи.ВалютнаяСуммаОстаток < Сумма 
			ИЛИ ВыборкаДетальныеЗаписи.СуммаОстаток < СуммаРУБ Тогда
			//ТекстСообщения = СтрШаблон("Суммы %1 к списанию на счете в валюте %2 по Организации %3 нет", Сумма, Валюта, Организация);
			//Сообщить(ТекстСообщения);	
			//Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Курс = 0 Тогда
		//ТекстСообщения = СтрШаблон("Курс по валюте %1 на дату документа %2 не заполнен", Валюта, Дата);
		//Сообщить(ТекстСообщения);	
		//Отказ = Истина;
	КонецЕсли;
	
	// регистр ХозрасчетныйМС 
	Движения.ХозрасчетныйМС.Записывать = Истина;
	Движение = Движения.ХозрасчетныйМС.Добавить();
	Движение.СчетДт = СчетДт;
	Движение.СчетКт = СчетКт;
	Движение.Период = Дата;
	Движение.Организация = Организация;
   	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетныеМС.Организации] = Организация;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетныеМС.БанковскиеСчета] = БанковскийСчет;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаРУБ;
	Движение.ВалютнаяСумма = Сумма;

КонецПроцедуры
